In [320]:
# %%html
# <style>
# @import url("https://bootswatch.com/4/materia/bootstrap.css")
# </style>

<h4 class="text-center"> Intro to DataFrame </h4>
<br>

In [214]:
import pandas as pd #Data Manipulation Library

In [215]:
#### Example of a DataFrame

<h4 class="text-center"> Adding Column and Row </h4>
<br>

In [216]:
data = pd.DataFrame()

In [217]:
data['Game'] = ['Inside','Limbo','Terraria']

In [218]:
data

       Game
0    Inside
1     Limbo
2  Terraria

In [219]:
type(data)

pandas.core.frame.DataFrame

In [220]:
#### Create another column

In [221]:
data['Genre'] = ['Horror','Indie','Action']

In [222]:
data

       Game   Genre
0    Inside  Horror
1     Limbo   Indie
2  Terraria  Action

In [223]:
#### Append a row

In [224]:
Hades = pd.Series(['Hades','Action'],index=['Game','Genre'])

In [225]:
Hades

Game      Hades
Genre    Action
dtype: object

In [226]:
data = data.append(Hades,ignore_index=True)

In [227]:
data

       Game   Genre
0    Inside  Horror
1     Limbo   Indie
2  Terraria  Action
3     Hades  Action

<h4 class="text-center"> Working With Real Life Dataset </h4>
<br>

In [228]:
#url = https://www.kaggle.com/c/titanic/data

In [229]:
raw_data = pd.read_csv('data/titanic_train.csv')

In [230]:
#### head()

In [231]:
raw_data.head() #print first 5 rows # .tail() method will do opposite of .head()

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0
3,449,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.0,1,3,29105,23.0000,NaN,S,4,NaN,"Cornwall / Akron, OH",1
4,576,2,"Veal, Mr. James",male,40.0,0,0,28221,13.0000,NaN,S,NaN,NaN,"Barre, Co Washington, VT",0

<span class="badge"> Info & Describe </span>

In [232]:
#to know how many column and rows dataset have
raw_data.shape

(850, 15)

In [233]:
# we have 850 rows and 15 columns

In [234]:
raw_data.info() # More Details information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 850 entries, 0 to 849
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  850 non-null    int64
 1   pclass        850 non-null    int64
 2   name          850 non-null    object
 3   sex           850 non-null    object
 4   age           676 non-null    float64
 5   sibsp         850 non-null    int64
 6   parch         850 non-null    int64
 7   ticket        850 non-null    object
 8   fare          849 non-null    float64
 9   cabin         191 non-null    object
 10  embarked      849 non-null    object
 11  boat          308 non-null    object
 12  body          73 non-null     float64
 13  home.dest     464 non-null    object
 14  survived      850 non-null    int64
dtypes: float64(3), int64(5), object(7)
memory usage: 99.7+ KB

In [235]:
#we got 3 float data 5 int type and 7 object type column

In [236]:
# .describe() will give statastical infomation about numeric column

In [237]:
raw_data.describe()

,passenger_id,pclass,age,sibsp,parch,fare,body,survived
count,850.000000,850.00000,676.000000,850.000000,850.000000,849.000000,73.000000,850.000000
mean,662.816471,2.32000,29.519847,0.522353,0.382353,34.012701,165.821918,0.368235
std,380.751936,0.83853,14.562243,1.112132,0.879511,53.705779,99.068487,0.482610
min,1.000000,1.00000,0.166700,0.000000,0.000000,0.000000,4.000000,0.000000
25%,332.250000,2.00000,20.000000,0.000000,0.000000,7.895800,75.000000,0.000000
50%,676.500000,3.00000,28.000000,0.000000,0.000000,14.108300,166.000000,0.000000
75%,992.250000,3.00000,37.000000,1.000000,0.000000,31.000000,260.000000,1.000000
max,1307.000000,3.00000,80.000000,8.000000,9.000000,512.329200,328.000000,1.000000

<span class="badge">Column </span>

In [238]:
raw_data['pclass'] #raw_data.pclass #Selectiong columns

0      3
1      3
2      3
3      2
4      2
      ..
845    1
846    1
847    2
848    3
849    2
Name: pclass, Length: 850, dtype: int64

In [239]:
raw_data[['pclass','age']].head() #selecting multiple column

   pclass   age
0       3   NaN
1       3  38.0
2       3  30.0
3       2  54.0
4       2  40.0

In [240]:
raw_data.loc[:5,['pclass','age']] #With loc method

   pclass   age
0       3   NaN
1       3  38.0
2       3  30.0
3       2  54.0
4       2  40.0
5       3  28.0

<span class="badge"> Row </span>

In [241]:
raw_data.iloc[0] #selecting first row

passenger_id                  1216
pclass                           3
name            Smyth, Miss. Julia
sex                         female
age                            NaN
sibsp                            0
parch                            0
ticket                      335432
fare                        7.7333
cabin                          NaN
embarked                         Q
boat                            13
body                           NaN
home.dest                      NaN
survived                         1
Name: 0, dtype: object

In [242]:
raw_data.iloc[:3] #selecting multiple rows #first three

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0

<h4 class="text-center"> Filter/Conditional </h4>
<br>

<span class="badge"> Data Filter </span>

In [243]:
raw_data[raw_data['sex']=='male'].head() #will select all rows which ['sex'] == 'male'

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
4,576,2,"Veal, Mr. James",male,40.0,0,0,28221,13.0000,NaN,S,NaN,NaN,"Barre, Co Washington, VT",0
5,1083,3,"Olsen, Mr. Henry Margido",male,28.0,0,0,C 4001,22.5250,NaN,S,NaN,173.0,NaN,0
6,898,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0000,NaN,S,NaN,NaN,NaN,0
10,313,1,"Widener, Mr. Harry Elkins",male,27.0,0,2,113503,211.5000,C82,C,NaN,NaN,"Elkins Park, PA",0

In [244]:
#### Multiple Condition

In [245]:
raw_data[ (raw_data['sex'] =='male') & (raw_data['age']>=50)].head(10)

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
49,330,2,"Ashby, Mr. John",male,57.0,0,0,244346,13.0000,NaN,S,NaN,NaN,"West Hoboken, NJ",0
143,86,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S,5 9,NaN,"Lima, Peru",1
153,782,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q,NaN,NaN,NaN,0
159,508,2,"Moraweck, Dr. Ernest",male,54.0,0,0,29011,14.0000,NaN,S,NaN,NaN,"Frankfort, KY",0
177,14,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks",1
190,1068,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S,NaN,NaN,NaN,0
224,300,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,B19,S,NaN,245.0,"Brooklyn, NY",0
247,115,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S,NaN,NaN,"Winnipeg, MB",0
276,506,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S,NaN,NaN,"Guernsey / Montclair, NJ and/or Toledo, Ohio",0
296,321,1,"Wright, Mr. George",male,62.0,0,0,113807,26.5500,NaN,S,NaN,NaN,"Halifax, NS",0

<h4 class="text-center"> Replace Values </h4>
<br>

In [246]:
#### Best Practice to create a copy of original dataset before chaning anything
titanic = raw_data.copy()

<span class="badge"> Replace </span>

In [247]:
titanic['sex'].replace('male','man').head()

0    female
1       man
2    female
3    female
4       man
Name: sex, dtype: object

In [248]:
#multiple replace
titanic['sex'].replace(['female','male'],['woman','man']).head()

0    woman
1      man
2    woman
3    woman
4      man
Name: sex, dtype: object

In [249]:
#Replace across full dataset
titanic.replace(1,'One').head()

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,One
1,699,3,"Cacic, Mr. Luka",male,38,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30,One,One,345773,24.1500,NaN,S,NaN,NaN,NaN,0
3,449,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54,One,3,29105,23.0000,NaN,S,4,NaN,"Cornwall / Akron, OH",One
4,576,2,"Veal, Mr. James",male,40,0,0,28221,13.0000,NaN,S,NaN,NaN,"Barre, Co Washington, VT",0

<h4 class="text-center"> Rename Columns </h4>
<br>

In [250]:
titanic.columns

Index(['passenger_id', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest',
       'survived'],
      dtype='object')

<span class="badge"> Rename </span>

In [251]:
titanic.rename(columns={'name':'full_name'}).head()

,passenger_id,pclass,full_name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0
3,449,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.0,1,3,29105,23.0000,NaN,S,4,NaN,"Cornwall / Akron, OH",1
4,576,2,"Veal, Mr. James",male,40.0,0,0,28221,13.0000,NaN,S,NaN,NaN,"Barre, Co Washington, VT",0

In [252]:
#multiple columns rename

In [253]:
titanic.rename(columns={'name':'full_name',
                       'sex':'gender',
                       'pclass':'passenger_class'}).head()

,passenger_id,passenger_class,full_name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0
3,449,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.0,1,3,29105,23.0000,NaN,S,4,NaN,"Cornwall / Akron, OH",1
4,576,2,"Veal, Mr. James",male,40.0,0,0,28221,13.0000,NaN,S,NaN,NaN,"Barre, Co Washington, VT",0

In [254]:
#To Rename all the columns Without Creating Dictionary

In [255]:
titanic.columns

Index(['passenger_id', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest',
       'survived'],
      dtype='object')

In [256]:
new_columns = ['passenger_id', 'Passenger_class', 'Title', 'Gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest',
       'survived']

In [257]:
titanic.columns = new_columns

In [258]:
titanic.head(2)

,passenger_id,Passenger_class,Title,Gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0

In [259]:
###### To Print all the columns name
import collections

column_names = collections.defaultdict(str)
for name in titanic.columns:
    column_names[name]

In [260]:
column_names

defaultdict(str,
            {'passenger_id': '',
             'Passenger_class': '',
             'Title': '',
             'Gender': '',
             'age': '',
             'sibsp': '',
             'parch': '',
             'ticket': '',
             'fare': '',
             'cabin': '',
             'embarked': '',
             'boat': '',
             'body': '',
             'home.dest': '',
             'survived': ''})

<h4 class="text-center"> Data Aggregation <h4>
<br>

In [261]:
#creating a function
def column_aggregation(data,column):
    print('Max Number: ', data[column].max() )
    print('Min Number: ', data[column].min() )
    print('Average Number: ', data[column].mean() )
    print('Sum Number: ', data[column].sum() )
    print('Count Number: ', data[column].count() )

In [262]:
column_aggregation(titanic,'age') #for age column

Max Number:  80.0
Min Number:  0.1667
Average Number:  29.519847189349115
Sum Number:  19955.4167
Count Number:  676

In [263]:
column_aggregation(titanic,'fare')

Max Number:  512.3292
Min Number:  0.0
Average Number:  34.012700942284994
Sum Number:  28876.7831
Count Number:  849

In [264]:
# Aggregation on full dataset

In [265]:
titanic.count()

passenger_id       850
Passenger_class    850
Title              850
Gender             850
age                676
sibsp              850
parch              850
ticket             850
fare               849
cabin              191
embarked           849
boat               308
body                73
home.dest          464
survived           850
dtype: int64

<h4 class="text-center"> Unique Values </h4>
<br>

<span class="badge"> Unique </span>

In [266]:
titanic['Gender'].unique() #give the unique values

array(['female', 'male'], dtype=object)

In [267]:
titanic['Passenger_class'].unique()

array([3, 2, 1], dtype=int64)

<span class="badge"> Value Counts </span>

In [268]:
titanic['Gender'].value_counts() #count the values of all unique number

male      551
female    299
Name: Gender, dtype: int64

In [269]:
titanic['Passenger_class'].value_counts()

3    478
1    206
2    166
Name: Passenger_class, dtype: int64

<span class="badge"> nunique <span>

In [270]:
titanic['Gender'].nunique() # will give numeric result of unique values

2

In [271]:
titanic['Passenger_class'].nunique()

3

<h4 class="text-center">Print Missing Values <h4>
<br>

<span class="badge"> isnull <span>

In [272]:
titanic.isnull().sum() # will show how many missing values are in the columns
# titanic.isna().sum()

passenger_id         0
Passenger_class      0
Title                0
Gender               0
age                174
sibsp                0
parch                0
ticket               0
fare                 1
cabin              659
embarked             1
boat               542
body               777
home.dest          386
survived             0
dtype: int64

In [273]:
#filter missing values
titanic[titanic['age'].isnull()].head()

,passenger_id,Passenger_class,Title,Gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
17,1003,3,"McCoy, Mr. Bernard",male,NaN,2,0,367226,23.2500,NaN,Q,16,NaN,NaN,1
21,1030,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,NaN,NaN,NaN,0
28,775,3,"Doharr, Mr. Tannous",male,NaN,0,0,2686,7.2292,NaN,C,NaN,NaN,NaN,0
30,15,1,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY",0

<h4 class="text-center"> Drop Columns </h4>
<br>

In [274]:
titanic.head(2)

,passenger_id,Passenger_class,Title,Gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0

In [275]:
titanic.drop('passenger_id',axis=1).head(2) # column drop/axis=1

,Passenger_class,Title,Gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0

In [276]:
#### drop with column index
titanic.drop(titanic.columns[0],axis=1).head(2)

,Passenger_class,Title,Gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0

<h4 class="text-center"> Drop Rows <h4>
<br>

In [277]:
titanic.drop(0,axis=0).head(2)

,passenger_id,Passenger_class,Title,Gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0

In [278]:
titanic[titanic.index !=0].head(2)

,passenger_id,Passenger_class,Title,Gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0

In [279]:
#dropping column with condition
titanic[titanic['Gender'] != 'male'].head(3) #will drop all the rows where 'Gender'= Male

,passenger_id,Passenger_class,Title,Gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0
3,449,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.0,1,3,29105,23.0000,NaN,S,4,NaN,"Cornwall / Akron, OH",1

<h4 class="text-center"> Duplicate Rows </h4>
<br>

<span class="badge"> drop_duplicate <span>

In [280]:
titanic.drop_duplicates().shape

(850, 15)

In [281]:
titanic.shape

(850, 15)

In [282]:
#as we can see there is no duplicate rows in the dataset

In [283]:
data

       Game   Genre
0    Inside  Horror
1     Limbo   Indie
2  Terraria  Action
3     Hades  Action

In [284]:
data = data.append(Hades,ignore_index=True)

In [285]:
data

       Game   Genre
0    Inside  Horror
1     Limbo   Indie
2  Terraria  Action
3     Hades  Action
4     Hades  Action

In [286]:
len(data) #original row has 5

5

In [287]:
len(data.drop_duplicates()) #after removing duplicate rows , length of rows =4

4

<span class="badge"> Subset<span>

In [288]:
titanic.drop_duplicates(subset=['Gender']) #as Gender has lots of duplicate values it takes first two and delete all rows

,passenger_id,Passenger_class,Title,Gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0

In [289]:
titanic.drop_duplicates(subset=['Gender'],keep='last')

,passenger_id,Passenger_class,Title,Gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
848,1112,3,"Peacock, Miss. Treasteall",female,3.0,1,1,SOTON/O.Q. 3101315,13.775,NaN,S,NaN,NaN,NaN,0
849,425,2,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,13.000,NaN,S,NaN,19.0,"Bronx, NY",0

<h4 class="text-center"> Group </h4>
<br>

In [290]:
titanic.groupby('Gender')

In [291]:
titanic.groupby('Gender').sum()

,passenger_id,Passenger_class,age,sibsp,parch,fare,body,survived
Gender,,,,,,,,
female,176203,642,7099.1667,212,175,14155.4881,921.0,210
male,387191,1330,12856.2500,232,150,14721.2950,11184.0,103

In [292]:
titanic.groupby('Gender').mean()

,passenger_id,Passenger_class,age,sibsp,parch,fare,body,survived
Gender,,,,,,,,
female,589.307692,2.147157,28.858401,0.709030,0.585284,47.342770,184.200000,0.702341
male,702.705989,2.413793,29.898256,0.421053,0.272232,26.765991,164.470588,0.186933

In [293]:
#selecting single columns
titanic.groupby('Gender')['age'].count()

Gender
female    246
male      430
Name: age, dtype: int64

In [294]:
#selecting multiple columns
titanic.groupby('Gender')[['age','fare']].mean()

              age       fare
Gender
female  28.858401  47.342770
male    29.898256  26.765991

<span class="badge"> Multiple Groupby <span>

In [295]:
titanic.groupby(['Gender','survived'])

In [296]:
titanic.groupby(['Gender','survived']).count()

                 passenger_id  Passenger_class  Title  age  sibsp  parch  \
Gender survived
female 0                   89               89     89   68     89     89
       1                  210              210    210  178    210    210
male   0                  448              448    448  342    448    448
       1                  103              103    103   88    103    103

                 ticket  fare  cabin  embarked  boat  body  home.dest
Gender survived
female 0             89    89      7        89     1     5         33
       1            210   210     88       209   199     0        146
male   0            448   447     57       448     7    68        221
       1            103   103     39       103   101     0         64

In [297]:
titanic.groupby(['Gender','survived'])[['age','fare']].mean()

                       age       fare
Gender survived
female 0         23.272059  24.566576
       1         30.992510  56.995537
male   0         31.361842  23.536398
       1         24.210227  40.781795

<span class="badge"> GroupBy Time Series </span>

In [298]:
import numpy as np

In [299]:
time_index = pd.date_range('01/01/2020',periods=100,freq='M')

In [300]:
len(time_index)

100

In [301]:
time_df = pd.DataFrame(index=time_index)

In [302]:
time_df.head()

Empty DataFrame
Columns: []
Index: [2020-01-31 00:00:00, 2020-02-29 00:00:00, 2020-03-31 00:00:00, 2020-04-30 00:00:00, 2020-05-31 00:00:00]

In [303]:
time_df['Price'] = np.random.randint(1,50,100)

In [304]:
time_df.head()

            Price
2020-01-31      2
2020-02-29      7
2020-03-31     28
2020-04-30     28
2020-05-31      9

In [305]:
time_df.head()

            Price
2020-01-31      2
2020-02-29      7
2020-03-31     28
2020-04-30     28
2020-05-31      9

In [306]:
time_df.resample('Y').sum() #summing as Yearly

            Price
2020-12-31    224
2021-12-31    243
2022-12-31    310
2023-12-31    281
2024-12-31    260
2025-12-31    207
2026-12-31    361
2027-12-31    258
2028-12-31     97

<h4 class="text-center"> Loop over Column <h4>
<br>

In [307]:
titanic.head()

,passenger_id,Passenger_class,Title,Gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0
3,449,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.0,1,3,29105,23.0000,NaN,S,4,NaN,"Cornwall / Akron, OH",1
4,576,2,"Veal, Mr. James",male,40.0,0,0,28221,13.0000,NaN,S,NaN,NaN,"Barre, Co Washington, VT",0

In [308]:
titanic['Title'][:5]

0                                   Smyth, Miss. Julia
1                                      Cacic, Mr. Luka
2    Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...
3                Hocking, Mrs. Elizabeth (Eliza Needs)
4                                      Veal, Mr. James
Name: Title, dtype: object

In [309]:
for name in titanic['Title'][:5]:
    print(name.upper())

SMYTH, MISS. JULIA
CACIC, MR. LUKA
VAN IMPE, MRS. JEAN BAPTISTE (ROSALIE PAULA GOVAERT)
HOCKING, MRS. ELIZABETH (ELIZA NEEDS)
VEAL, MR. JAMES

<span class="badge"> List Comprehenshion <span>

In [310]:
[name.upper() for name in titanic['Title'][:5]]

['SMYTH, MISS. JULIA',
 'CACIC, MR. LUKA',
 'VAN IMPE, MRS. JEAN BAPTISTE (ROSALIE PAULA GOVAERT)',
 'HOCKING, MRS. ELIZABETH (ELIZA NEEDS)',
 'VEAL, MR. JAMES']

<h4 class="text-center"> Apply Function </h4>

In [311]:
def all_upper(x):
    return x.upper()

In [312]:
titanic['Title'].apply(all_upper)[:5]

0                                   SMYTH, MISS. JULIA
1                                      CACIC, MR. LUKA
2    VAN IMPE, MRS. JEAN BAPTISTE (ROSALIE PAULA GO...
3                HOCKING, MRS. ELIZABETH (ELIZA NEEDS)
4                                      VEAL, MR. JAMES
Name: Title, dtype: object

<span class="badge"> Functions to Group </span>

In [313]:
titanic.groupby('Gender').mean()

,passenger_id,Passenger_class,age,sibsp,parch,fare,body,survived
Gender,,,,,,,,
female,589.307692,2.147157,28.858401,0.709030,0.585284,47.342770,184.200000,0.702341
male,702.705989,2.413793,29.898256,0.421053,0.272232,26.765991,164.470588,0.186933

In [314]:
titanic.groupby('Gender').apply(lambda x:x.mean())

,passenger_id,Passenger_class,age,sibsp,parch,fare,body,survived
Gender,,,,,,,,
female,589.307692,2.147157,28.858401,0.709030,0.585284,47.342770,184.200000,0.702341
male,702.705989,2.413793,29.898256,0.421053,0.272232,26.765991,164.470588,0.186933

<h4 class="text-center"> Concatenate & Merge</h4>
<br>

<span class="badge">Concat</span>

In [315]:
data

       Game   Genre
0    Inside  Horror
1     Limbo   Indie
2  Terraria  Action
3     Hades  Action
4     Hades  Action

In [316]:
data2 = pd.DataFrame({'Game':['Inside','Limbo','Hades'],
                     'Year':['2002','2002','2002']})

In [317]:
data2

     Game  Year
0  Inside  2002
1   Limbo  2002
2   Hades  2002

In [318]:
pd.concat([data,data2],axis=1)

       Game   Genre    Game  Year
0    Inside  Horror  Inside  2002
1     Limbo   Indie   Limbo  2002
2  Terraria  Action   Hades  2002
3     Hades  Action     NaN   NaN
4     Hades  Action     NaN   NaN

<span class="badge"> Merge </span>

In [319]:
pd.merge(data,data2,on='Game') #Default = 'innerJoin'

     Game   Genre  Year
0  Inside  Horror  2002
1   Limbo   Indie  2002
2   Hades  Action  2002
3   Hades  Action  2002